<center> <img src = https://raw.githubusercontent.com/AndreyRysistov/DatasetsForPandas/main/hh%20label.jpg alt="drawing" style="width:400px;">

# <center> Проект: Анализ вакансий из HeadHunter

In [1]:
import pandas as pd
import psycopg2
import requests
from bs4 import BeautifulSoup

In [2]:
# вставьте сюда параметры подключения из юнита 1. Работа с базой данных из Python
connection = psycopg2.connect(
    dbname='project_sql',
    user='skillfactory',
    host='84.201.134.129',
    password='cCkxxLVrDE8EbvjueeMedPKt',
    port=5432
)

# Юнит 3. Предварительный анализ данных

1. Напишите запрос, который посчитает количество вакансий в нашей базе (вакансии находятся в таблице vacancies).

In [4]:
# текст запроса
query_3_1 = f'''select count(*) as vacancies_count
                from public.vacancies
'''

In [5]:
# результат запроса
pd.read_sql_query(query_3_1, connection)

C:\Users\Люля\AppData\Local\Temp\ipykernel_1180\1469115235.py:2: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  pd.read_sql_query(query_3_1, connection)

   vacancies_count
0            49197

2. Напишите запрос, который посчитает количество работодателей (таблица employers).

In [6]:
# текст запроса
query_3_2 = f'''select count(*) as employers_count
                from public.employers
'''

In [7]:
# результат запроса
pd.read_sql_query(query_3_2, connection)

C:\Users\Люля\AppData\Local\Temp\ipykernel_1180\4057088587.py:2: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  pd.read_sql_query(query_3_2, connection)

   employers_count
0            23501

3. Посчитате с помощью запроса количество регионов (таблица areas).

In [8]:
# текст запроса
query_3_3 = f'''select count(*) as areas_count
                from public.areas
'''

In [9]:
# результат запроса
pd.read_sql_query(query_3_3, connection)

C:\Users\Люля\AppData\Local\Temp\ipykernel_1180\4147122770.py:2: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  pd.read_sql_query(query_3_3, connection)

   areas_count
0         1362

4. Посчитате с помощью запроса количество сфер деятельности в базе (таблица industries).

In [10]:
# текст запроса
query_3_4 = f'''select count(*) as industries_count
                from public.industries
'''

In [11]:
# результат запроса
pd.read_sql_query(query_3_4, connection)

C:\Users\Люля\AppData\Local\Temp\ipykernel_1180\2627729322.py:2: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  pd.read_sql_query(query_3_4, connection)

   industries_count
0               294

***

In [12]:
# выводы по предварительному анализу данных

# Юнит 4. Детальный анализ вакансий

1. Напишите запрос, который позволит узнать, сколько (cnt) вакансий в каждом регионе (area).
Отсортируйте по количеству вакансий в порядке убывания.

In [13]:
# текст запроса
n = 5
query_4_1 = f'''select 
                    count(v.id) as vacancies_count,
                    a.name as area
                from 
                    public.vacancies as v
                join 
                    public.areas as a on v.area_id = a.id
                group by 
                    a.name
                order by 
                    count(v.id) desc
                limit {n}
'''

In [14]:
# результат запроса
pd.read_sql_query(query_4_1, connection)

C:\Users\Люля\AppData\Local\Temp\ipykernel_1180\4222419522.py:2: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  pd.read_sql_query(query_4_1, connection)

   vacancies_count             area
0             5333           Москва
1             2851  Санкт-Петербург
2             2112            Минск
3             2006      Новосибирск
4             1892           Алматы

2. Напишите запрос, чтобы определить у какого количества вакансий заполнено хотя бы одно из двух полей с зарплатой.

In [15]:
# текст запроса
query_4_2 = f'''select 
                    count(*) as vacancies_with_salary
                from 
                    public.vacancies
                where
                    salary_from is not null 
                    or salary_to is not null      
'''

In [16]:
# результат запроса
pd.read_sql_query(query_4_2, connection)

C:\Users\Люля\AppData\Local\Temp\ipykernel_1180\614600247.py:2: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  pd.read_sql_query(query_4_2, connection)

   vacancies_with_salary
0                  24073

3. Найдите средние значения для нижней и верхней границы зарплатной вилки. Округлите значения до целого.

In [17]:
# текст запроса
query_4_3 = f'''select 
                    round(avg(salary_from)) as avg_salary_min,
                    round(avg(salary_to)) as avg_salary_max
                from 
                    public.vacancies    
'''

In [18]:
# результат запроса
pd.read_sql_query(query_4_3, connection)

C:\Users\Люля\AppData\Local\Temp\ipykernel_1180\3534961570.py:2: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  pd.read_sql_query(query_4_3, connection)

   avg_salary_min  avg_salary_max
0         71065.0        110537.0

4. Напишите запрос, который выведет количество вакансий для каждого сочетания типа рабочего графика (schedule) и типа трудоустройства (employment), используемого в вакансиях. Результат отсортируйте по убыванию количества.

In [19]:
# текст запроса
query_4_4 = f'''select 
                    schedule,
                    employment,
                    count(*) as vacancies_count
                from 
                    public.vacancies
                group by
                    schedule, employment
                order by count(*) desc
'''

In [20]:
# результат запроса
pd.read_sql_query(query_4_4, connection)

C:\Users\Люля\AppData\Local\Temp\ipykernel_1180\2630570843.py:2: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  pd.read_sql_query(query_4_4, connection)

            schedule           employment  vacancies_count
0        Полный день     Полная занятость            35367
1   Удаленная работа     Полная занятость             7802
2      Гибкий график     Полная занятость             1593
3   Удаленная работа  Частичная занятость             1312
4     Сменный график     Полная занятость              940
5        Полный день           Стажировка              569
6     Вахтовый метод     Полная занятость              367
7        Полный день  Частичная занятость              347
8      Гибкий график  Частичная занятость              312
9        Полный день     Проектная работа              141
10  Удаленная работа     Проектная работа              133
11     Гибкий график           Стажировка              116
12    Сменный график  Частичная занятость              101
13  Удаленная работа           Стажировка               64
14     Гибкий график     Проектная работа               18
15    Сменный график           Стажировка               12
16    Вахтовый метод     Проектная работа                2
17    Сменный график     Проектная работа                1

5. Напишите запрос, выводящий значения поля Требуемый опыт работы (experience) в порядке возрастания количества вакансий, в которых указан данный вариант опыта.

In [21]:
# текст запроса
query_4_5 = f'''select 
                    experience,
                    count(*) as experience_count
                from 
                    public.vacancies
                group by
                    experience
                order by count(*) desc
'''

In [22]:
# результат запроса
pd.read_sql_query(query_4_5, connection)

C:\Users\Люля\AppData\Local\Temp\ipykernel_1180\3190483664.py:2: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  pd.read_sql_query(query_4_5, connection)

           experience  experience_count
0  От 1 года до 3 лет             26152
1       От 3 до 6 лет             14511
2           Нет опыта              7197
3         Более 6 лет              1337

***

In [23]:
# выводы по детальному анализу вакансий

# Юнит 5. Анализ работодателей

1. Напишите запрос, который позволит узнать, какие работодатели находятся на первом и пятом месте по количеству вакансий.

In [24]:
# текст запроса
n = 5
query_5_1 = f'''select 
                    count(v.id) as vacancies_count,
                    e.name as employers
                from 
                    public.vacancies as v
                join 
                    public.employers as e on v.employer_id = e.id
                group by 
                    e.name
                order by 
                    count(v.id) desc
                limit {n}
'''

In [25]:
# результат запроса
pd.read_sql_query(query_5_1, connection)

C:\Users\Люля\AppData\Local\Temp\ipykernel_1180\3902369145.py:2: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  pd.read_sql_query(query_5_1, connection)

   vacancies_count      employers
0             1933         Яндекс
1              491     Ростелеком
2              444       Тинькофф
3              428           СБЕР
4              331  Газпром нефть

2. Напишите запрос, который для каждого региона выведет количество работодателей и вакансий в нём.
Среди регионов, в которых нет вакансий, найдите тот, в котором наибольшее количество работодателей.

In [26]:
# текст запроса
query_5_2 = f'''select 
                    a.name as area,
                    count(v.id) as vacancies_count,
                    count(e.id) as employers_count
                from 
                    public.areas as a
                left join 
                    public.employers as e on a.id = e.area
                left join
                    public.vacancies as v on v.area_id = a.id
                group by 
                    a.name
                having
                    count(v.id) = 0
                order by 
                    count(e.id) desc
'''

In [27]:
# результат запроса
pd.read_sql_query(query_5_2, connection)

C:\Users\Люля\AppData\Local\Temp\ipykernel_1180\2146817738.py:2: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  pd.read_sql_query(query_5_2, connection)

                             area  vacancies_count  employers_count
0                          Россия                0              410
1                       Казахстан                0              207
2              Московская область                0               75
3              Краснодарский край                0               19
4              Ростовская область                0               18
..                            ...              ...              ...
588                      Струнино                0                0
589    Славгород (Алтайский край)                0                0
590                     Сорочинск                0                0
591  Ленинский (Тульская область)                0                0
592                         Тавда                0                0

[593 rows x 3 columns]

3. Для каждого работодателя посчитайте количество регионов, в которых он публикует свои вакансии. Отсортируйте результат по убыванию количества.

In [28]:
# текст запроса
query_5_3 = f'''select 
                    e.name as employer,
                    count(distinct a.id) as areas_count
                from
                    public.vacancies as v
                join 
                    public.employers as e on v.employer_id = e.id
                join
                    public.areas as a on v.area_id = a.id
                group by 
                    e.name
                order by 
                    count(distinct a.id) desc
'''

In [29]:
# результат запроса
pd.read_sql_query(query_5_3, connection)

C:\Users\Люля\AppData\Local\Temp\ipykernel_1180\593965358.py:2: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  pd.read_sql_query(query_5_3, connection)

                     employer  areas_count
0                      Яндекс          181
1                  Ростелеком          152
2                  Спецремонт          116
3      Поляков Денис Иванович           88
4                   ООО ЕФИН            71
...                       ...          ...
14761                  UniSol            1
14762            UNISTORY LLC            1
14763                   UNIT6            1
14764     United Distribution            1
14765              UNITEL LLC            1

[14766 rows x 2 columns]

4. Напишите запрос для подсчёта количества работодателей, у которых не указана сфера деятельности.

In [30]:
# текст запроса
query_5_4 = f'''select 
                    count (e.id) as employer_no_industry
                from
                    public.employers as e
                left join 
                    public.employers_industries as ei on ei.employer_id = e.id
                where
                    ei.industry_id is null
'''

In [31]:
# результат запроса
pd.read_sql_query(query_5_4, connection)

C:\Users\Люля\AppData\Local\Temp\ipykernel_1180\1644714913.py:2: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  pd.read_sql_query(query_5_4, connection)

   employer_no_industry
0                  8419

5. Напишите запрос, чтобы узнать название компании, находящейся на третьем месте в алфавитном списке (по названию) компаний, у которых указано четыре сферы деятельности.

In [34]:
# текст запроса
query_5_5 = f'''select 
                    e.name,
                    count (ei.industry_id) as industries
                from
                    public.employers as e
                left join 
                    public.employers_industries as ei on ei.employer_id = e.id
                group by
                    e.name
                having
                    count (ei.industry_id) = 4
                order by
                    e.name
'''

In [35]:
# результат запроса
pd.read_sql_query(query_5_5, connection)

C:\Users\Люля\AppData\Local\Temp\ipykernel_1180\1169902027.py:2: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  pd.read_sql_query(query_5_5, connection)

                 name  industries
0        101 Интернет           4
1            21vek.by           4
2                2ГИС           4
3                  2К           4
4         4 пикселя +           4
...               ...         ...
1131            ЮРИОН           4
1132  ЮТИП Технологии           4
1133           ЯКласс           4
1134            ЯрНео           4
1135    Яшин&Партнёры           4

[1136 rows x 2 columns]

6. С помощью запроса выясните, у какого количества работодателей в качестве сферы деятельности указана Разработка программного обеспечения.

In [40]:
# текст запроса
query_5_6 = f'''select 
                   i.name,
                   count (ei.employer_id) as employers_count
                from
                    public.industries as i
                left join 
                    public.employers_industries as ei on ei.industry_id = i.id
                group by
                    i.name
                having
                    i.name = 'Разработка программного обеспечения'
'''

In [41]:
# результат запроса
pd.read_sql_query(query_5_6, connection)

C:\Users\Люля\AppData\Local\Temp\ipykernel_1180\2878008418.py:2: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  pd.read_sql_query(query_5_6, connection)

                                  name  employers_count
0  Разработка программного обеспечения             3553

7. Для компании «Яндекс» выведите список регионов-миллионников, в которых представлены вакансии компании, вместе с количеством вакансий в этих регионах. Также добавьте строку Total с общим количеством вакансий компании. Результат отсортируйте по возрастанию количества.

Список городов-милионников надо взять [отсюда](https://ru.wikipedia.org/wiki/%D0%93%D0%BE%D1%80%D0%BE%D0%B4%D0%B0-%D0%BC%D0%B8%D0%BB%D0%BB%D0%B8%D0%BE%D0%BD%D0%B5%D1%80%D1%8B_%D0%A0%D0%BE%D1%81%D1%81%D0%B8%D0%B8). 

Если возникнут трудности с этим задание посмотрите материалы модуля  PYTHON-17. Как получать данные из веб-источников и API.

In [48]:
# код для получения списка городов-милионников
url = 'https://ru.wikipedia.org/wiki/Города-миллионеры_России#Список_городов-миллионеров'
content = requests.get(url)
soup = BeautifulSoup(content.text, 'html.parser')
table = soup.find('table', class_='standard sortable').find_all('a')[4:]

cities = []
for i in table:
    table = i.text
    cities.append(table)

cities.remove('[a]')
cities = tuple(cities)

In [63]:
# текст запроса
query_5_7 = f'''select 
                   a.name as area,
                   count (v.id) as vacancies
                from
                    public.vacancies as v
                join 
                    public.employers as e on v.employer_id = e.id
                join
                    public.areas as a on v.area_id = a.id
                group by
                    e.name, a.name
                having
                    e.name = 'Яндекс' and a.name in {cities}
                
                UNION ALL
                
                select 
                   'total',
                   count (v.id)
                from
                    public.vacancies as v
                join 
                    public.employers as e on v.employer_id = e.id
                join
                    public.areas as a on v.area_id = a.id
                where
                    a.name in {cities}
                group by
                    e.name
                having
                    e.name = 'Яндекс'
                order by
                    2
'''

In [64]:
# результат запроса
pd.read_sql_query(query_5_7, connection)

C:\Users\Люля\AppData\Local\Temp\ipykernel_6568\1216511710.py:2: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  pd.read_sql_query(query_5_7, connection)

               area  vacancies
0              Омск         21
1         Челябинск         22
2        Красноярск         23
3         Волгоград         24
4             Пермь         25
5            Казань         25
6    Ростов-на-Дону         25
7               Уфа         26
8            Самара         26
9         Краснодар         30
10          Воронеж         32
11      Новосибирск         35
12  Нижний Новгород         36
13     Екатеринбург         39
14  Санкт-Петербург         42
15           Москва         54
16            total        485

***

In [ ]:
# выводы по анализу работодателей

# Юнит 6. Предметный анализ

1. Сколько вакансий имеет отношение к данным?

Считаем, что вакансия имеет отношение к данным, если в её названии содержатся слова 'data' или 'данн'.

*Подсказка: Обратите внимание, что названия вакансий могут быть написаны в любом регистре.*

In [77]:
# текст запроса
query_6_1 = f'''select 
                   count(*) as data_vacancies
                from
                    public.vacancies
                where
                    lower(name) like '%data%' or lower(name) like '%данн%'
'''

In [78]:
# результат запроса
pd.read_sql_query(query_6_1, connection)

C:\Users\Люля\AppData\Local\Temp\ipykernel_6568\2603769340.py:2: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  pd.read_sql_query(query_6_1, connection)

   data_vacancies
0            1771

2. Сколько есть подходящих вакансий для начинающего дата-сайентиста? 
Будем считать вакансиями для дата-сайентистов такие, в названии которых есть хотя бы одно из следующих сочетаний:
* 'data scientist'
* 'data science'
* 'исследователь данных'
* 'ML' (здесь не нужно брать вакансии по HTML)
* 'machine learning'
* 'машинн%обучен%'

** В следующих заданиях мы продолжим работать с вакансиями по этому условию.*

Считаем вакансиями для специалистов уровня Junior следующие:
* в названии есть слово 'junior' *или*
* требуемый опыт — Нет опыта *или*
* тип трудоустройства — Стажировка.

In [112]:
# текст запроса
query_6_2 = f'''select 
                   count(*) as junior_data_vacancies
                from
                    public.vacancies
                where
                    (lower(name) like '%data scientist%'
                    or lower(name) like '%data science%'
                    or lower(name) like '%исследователь данных%'
                    or name like '%ML%'
                    or lower(name) like '%machine learning%'
                    or lower(name) like '%машинн%обучен%')
                    and name not like '%HTML%'
                    and (lower(name) like '%junior%'
                    or experience = 'Нет опыта'
                    or employment = 'Стажировка')
'''

In [113]:
# результат запроса
pd.read_sql_query(query_6_2, connection)

C:\Users\Люля\AppData\Local\Temp\ipykernel_6568\2428688723.py:2: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  pd.read_sql_query(query_6_2, connection)

   junior_data_vacancies
0                     51

3. Сколько есть вакансий для DS, в которых в качестве ключевого навыка указан SQL или postgres?

** Критерии для отнесения вакансии к DS указаны в предыдущем задании.*

In [110]:
# текст запроса
query_6_3 = f'''select 
                   count(*) as junior_data_vacancies
                from
                    public.vacancies
                where
                    (lower(name) like '%data scientist%'
                    or lower(name) like '%data science%'
                    or lower(name) like '%исследователь данных%'
                    or name like '%ML%'
                    or lower(name) like '%machine learning%'
                    or lower(name) like '%машинн%обучен%')
                    and name not like '%HTML%'
                    and (key_skills like '%SQL%'
                    or key_skills like '%postgres%')
'''

In [111]:
# результат запроса
pd.read_sql_query(query_6_3, connection)

C:\Users\Люля\AppData\Local\Temp\ipykernel_6568\3902879435.py:2: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  pd.read_sql_query(query_6_3, connection)

   junior_data_vacancies
0                    201

4. Проверьте, насколько популярен Python в требованиях работодателей к DS.Для этого вычислите количество вакансий, в которых в качестве ключевого навыка указан Python.

** Это можно сделать помощью запроса, аналогичного предыдущему.*

In [114]:
# текст запроса
query_6_4 = f'''select 
                   count(*) as junior_data_vacancies
                from
                    public.vacancies
                where
                    (lower(name) like '%data scientist%'
                    or lower(name) like '%data science%'
                    or lower(name) like '%исследователь данных%'
                    or name like '%ML%'
                    or lower(name) like '%machine learning%'
                    or lower(name) like '%машинн%обучен%')
                    and name not like '%HTML%'
                    and lower(key_skills) like '%python%'
'''

In [115]:
# результат запроса
pd.read_sql_query(query_6_4, connection)

C:\Users\Люля\AppData\Local\Temp\ipykernel_6568\2548700122.py:2: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  pd.read_sql_query(query_6_4, connection)

   junior_data_vacancies
0                    351

5. Сколько ключевых навыков в среднем указывают в вакансиях для DS?
Ответ округлите до двух знаков после точки-разделителя.

In [151]:
# текст запроса
query_6_5 = f'''select 
                  round(avg(length(key_skills) - length(replace(key_skills, CHR(9), '')) +1), 2) as avg_skills_number
                from
                    public.vacancies
                where
                    (lower(name) like '%data scientist%'
                    or lower(name) like '%data science%'
                    or lower(name) like '%исследователь данных%'
                    or name like '%ML%'
                    or lower(name) like '%machine learning%'
                    or lower(name) like '%машинн%обучен%')
                    and name not like '%HTML%'
                    and key_skills is not null
'''

In [152]:
# результат запроса
pd.read_sql_query(query_6_5, connection)

C:\Users\Люля\AppData\Local\Temp\ipykernel_6568\3854041181.py:2: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  pd.read_sql_query(query_6_5, connection)

   avg_skills_number
0               6.41

6. Напишите запрос, позволяющий вычислить, какую зарплату для DS в **среднем** указывают для каждого типа требуемого опыта (уникальное значение из поля *experience*). 

При решении задачи примите во внимание следующее:
1. Рассматриваем только вакансии, у которых заполнено хотя бы одно из двух полей с зарплатой.
2. Если заполнены оба поля с зарплатой, то считаем зарплату по каждой вакансии как сумму двух полей, делённую на 2. Если заполнено только одно из полей, то его и считаем зарплатой по вакансии.
3. Если в расчётах участвует null, в результате он тоже даст null (посмотрите, что возвращает запрос select 1 + null). Чтобы избежать этой ситуацию, мы воспользуемся функцией [coalesce](https://postgrespro.ru/docs/postgresql/9.5/functions-conditional#functions-coalesce-nvl-ifnull), которая заменит null на значение, которое мы передадим. Например, посмотрите, что возвращает запрос `select 1 + coalesce(null, 0)`

Выясните, на какую зарплату в среднем может рассчитывать дата-сайентист с опытом работы от 3 до 6 лет. Результат округлите до целого числа.

In [195]:
# текст запроса
query_6_6 = f'''select 
                    experience,
                    round(avg((coalesce(salary_from, salary_to)+coalesce(salary_to, salary_from)) / 2))
                from
                    public.vacancies
                where
                    (lower(name) like '%data scientist%'
                    or lower(name) like '%data science%'
                    or lower(name) like '%исследователь данных%'
                    or name like '%ML%'
                    or lower(name) like '%machine learning%'
                    or lower(name) like '%машинн%обучен%')
                    and name not like '%HTML%'
                    and key_skills is not null
                    and (salary_from is not null
                    or salary_to is not null)
                group by
                    experience
'''

In [196]:
# результат запроса
pd.read_sql_query(query_6_6, connection)

#experience
# 0	Более 6 лет
# 1	Нет опыта
# 2	От 1 года до 3 лет
# 3	От 3 до 6 лет

C:\Users\Люля\AppData\Local\Temp\ipykernel_6568\3268199355.py:2: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  pd.read_sql_query(query_6_6, connection)

           experience     round
0           Нет опыта   74643.0
1  От 1 года до 3 лет  146704.0
2       От 3 до 6 лет  243115.0

***

In [ ]:
# выводы по предметному анализу

# Общий вывод по проекту

In [ ]:
# подведем итог исследования, обобщите выводы
# здесь можно (это будет плюсом) провести дополнительные исследования данных, сделать прогнозы, продумать варианты продолжения исследования